{
	"challenges": [
		{"title": "Tree Sum",
		"description": "Write a function to find the sum of all the odd numbers in a binary search tree.",
		"hints": ["Try using a variable to store your output.", "Have you considered using a recursive function?"],
		"solution": null,
		},
		{"title": "Max Stack",
		"description": "Write a max stack function that returns the largest element in a stack.",
		"hints": ["You can assume all the values in the stack are numbers.", "Consider using another data structure like an array or linked list somehow."],
		"solution": null,
		},
		{"title": "Reverse Linked List",
		"description": "Write a function that reverses a linked list.",
		"hints": ["You could make a copy of the list, but try finding an in-place solution.", "Have you thought of using a few temporary reference variables?"],
		"solution": null,
		},
		{"title": "Linked List Palindrome",
		"description": "Write a function to validate whether or not a linked list is a palindrome. Your return value should be a boolean.",
		"hints": ["A palindrome is a word, phrase, number or sequence of nodes that reads the same backward as forward.", "Have you ever reversed a linked list? One possible solution might utilize this approach."],
		"solution": null,
		},
		{"title": "Tree Traversal",
		"description": "Write a function that takes in a binary tree and log the value of each node within the tree.",
		"hints": ["Have you considered using recursion?", "The order of the nodes doesn't matter."],
		"solution": null,
		},
		{"title": "Matrix Sum",
		"description": "Write a function to add up the sum of each row in a matrix of arbitrary size, and return an array with the appropriate values.",
		"hints": ["A matrix is an array of arrays.", "Assume all values will be integers and consider null to be zero."],
		"solution": null,
		},
		{"title": "Fibonacci",
		"description": "Write a function that accepts an integer, and returns the nth number in the Fibonacci sequence.",
		"hints": ["Your solution should probably use recursion or iteration with a while or for loop.", "The fibonacci sequence adds the previous two numbers together. The first seven numbers are 0, 1, 1, 2, 3, 5, and 8"],
		"solution": null,
		},
		{"title": "Binary Search",
		"description": "Write a function called Binary Search which takes in 2 parameters: a sorted array and the search key. Without utilizing any of the built-in methods available to your language, return the index of the array’s element that is equal to the value of the search key, or -1 if the element is not in the array.",
		"hints": ["Remember to use a binary search, not a sequential search.", "You should be comparing the search value to the middle element in the array."],
		"solution": null,
		}
	]
}